//=============================================================================
//
// ゲート処理 [gate.h]
// Author : 國江 翔太
//
//=============================================================================
#pragma once

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGate(void);
void UninitGate(void);
void UpdateGate(void);
void DrawGate(void);

void SetStartGate(void);
void SetGoalGate(float goal_pos);