//=============================================================================
//
// ライト処理 [light.h]
// Author : 國江 翔太
//
//=============================================================================
#pragma once

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitLight(void);
void UpdateLight(void);

BOOL GetALUse(void);
BOOL GetDLUse(int lightNo);
BOOL GetPLUse(int lightNo);
BOOL GetSLUse(int lightNo);
BOOL GetPLAUse(void);
